from nonebot import on_keyword, on_command
from nonebot.typing import T_State
from nonebot.adapters.cqhttp import Message, Bot, Event  # 这两个没用的别删
from nonebot.adapters.cqhttp.message import MessageSegment
import requests
from nonebot.permission import *
from nonebot.rule import to_me
import random

dx = on_keyword({"生成一个对象"})
#cd=on_command('',rule=to_me(),priority=5)
@dx.handle()
async def dx_r(bot: Bot, event: Event, state: T_State):
    id = str(event.get_user_id())   
    list_name = ['荷倩',
                 '曼萱',
                 '珍露',
                 '雅怡',
                 '紫荷',
                 '芸矫',
                 '茜惠',
                 '芸韵',
                 '珍滟',
                 '紫珊',
                 '伊莉',
                 '凤瑶',
                 '瑾凤',
                 '倩燕',
                 '雅素',
                 '姗仪',
                 '柳瑶',
                 '姿凝',
                 '瑾媛',
                 '柔伊',
                 '香雅',
                 '素媚',
                 '卉韵',
                 '嫣翎',
                 '兰紫',
                 '璐盈',
                 '燕吟',
                 '碧漪',
                 '宛姿',
                 '嫱柳',
                 '荔苹',
                 '夏玫',
                 '宛妮',
                 '婕音',
                 '絮薇',
                 '曼姣',
                 '婉莲',
                 '素霜',
                 '燕娜',
                 '漫秀',
                 '紫翠',
                 '荔婷',
                 '莉盈',
                 '钰曼',
                 '韵儿',
                 '樱紫',
                 '珞璇',
                 '丹韵',
                 '仪珍',
                 '丹荷',
                 '芝荷',
                 '恬瑶',
                 '菁瑾',
                 '颖音',
                 '羚伊',
                 '瑾姝',
                 '岚凝',
                 '艾燕',
                ' 素枚',
                 '碧莉',
                 '琼燕',
                 '淑瑶',
                 '霜梦',
                 '虹荔',
                 '芸盈',
                 '兰珍',
                 '倩惠',
                 '盈怡',
                 '影丽',
                 '雅俐',
                 '瑶瑾',
                 '静芳',
                 '素绚',
                 '真茹',
                 '碧馨',
                 '秋燕',
                 '紫香',
                 '芳韵',
                 '宛倩',
                 '茜敏',
                 '滟静',
                 '紫姿',
                 '凤影',
                 '婕瑜',
                 '素雅',
                 '曼霓',
                 '碧燕',
                 '影娇',
                 '妍瑶',
                 '艾婕']
    name = random.choice(list_name)
    age = random.randint(16, 20)
    gao = random.randint(150, 190)
    zho = random.randint(80, 120)
    xiowei = ['a', 'b', 'c', 'd', 'e', 'f', 'j', 'h']
    xio = random.choice(xiowei)
    ka = ("可爱型\n"\
          "\n可爱型的女生是比较喜欢粘人的，"\
          "如果是有男朋友的话，塔肯定是每天都想跟着自己的男朋友，"\
          "但是说起话的声音甜美而且她们的性格是比较容易抓住人心的，"\
          "但是她们这种性格容易生气、喜欢撒娇、喜欢吃醋，一旦吃起醋来就会控制不住自己的心情，"\
          "就会默默不说话，有时候说话的特别的感动，这种性格是非常简单的，"\
          "唯一的让她有安全感的就是喜欢依赖她们喜欢的人和喜欢她们的人。")
    miand = ("缅甸型\n"\
             "\n这种性格的女生我觉得用深藏不露形容不太合适哈，"\
             "她们的性格内向的人只是不太用语音去表达，"\
             "不过当你和他们接触一段时间后，"\
             "其实你会发现她们也有开朗的一面的哈，"\
             "性格内向是从小的生活环境和经历过的一些事所形成的，"\
             "不是天生就这样的，性格腼腆是缺乏自信的表现，"\
             "当一个人对自己有信心的时候，就尽一切能力去表达自己，"\
             "也就不会腼腆了。建议腼腆的人多训练训练，"\
             "在自己遇到事的时候要尽量自然的去对待，不要对自己的能力怀疑。"\
             "经常鼓励自己说“我能行”。就能克服了，要对自己有信心。")
    nhz = ("女汉子\n"\
           "\n女汉子的性格千变万化，"\
           "高深莫测。首先是二；其次是豪爽、讲义气；在她们眼里没有性别之分，"\
           "都是哥们。当然爱情也是会出现的，"\
           "女汉子又不是性同者。女汉子的性格特点是："\
           "她们不会撒娇，性格是大大咧咧，而且是不喜欢化妆，异性缘好。")
    wm = ("完美型\n"\
          "\n现实生活中的她们是不会去依赖任何一个人，"\
          "她们会觉得所有的事情都应该由自己去完成，"\
          "哪怕她们觉得这件事完不成，但是她们会用尽她们妈的努力去完成，"\
          "讲求原则，事事安排有序，追求完美及善于自我批评，要求他们按自己的标准做事，"\
          "经常怒而不宣。而且她们的穿衣风格是比较整齐清洁，重质不重量，讲话讲求理性。")
    kl = ("快乐型\n"\
          "\n这种性格的人一般都是有才艺，而且性格是冲动及急躁，"\
          "但是有时候也是活泼开朗，爱玩，希望为世界，她们很爱笑，"\
          "刚开始认识一个人的时候，她们是不爱说话的，刚开始给人的感觉就是腼腆，"\
          "但一旦熟悉了，那么这时候才是露出原型的时候，她们会疯狂的去给人带来欢乐，在朋友目前是很不要脸的。")
    lx = ("领袖型\n"\
          "\n这种性格的人自信、坚强、好斗，及具破坏力，喜欢替他人作主发号施令，"\
          "渴望成为领导者，很多时候是害怕被别人发现自己弱小的一面，"\
          "所以她们会把自己的弱小的一面装起来，给人的感觉就是她们每天都是这么的开心，没有烦恼。")
    xg_b = ('温柔体贴',
            '活泼开朗',
            ka,
            miand,
            nhz,
            wm,
            kl,
            lx,
            )
    xg = random.choice(xg_b)
    objects = {
        "name":name,
        "age":age,
        "height":gao,
        "weight":zho,
        "chest":xio,
        "character":xg,
        }

    lists = []

    for value in objects.values():
        #print(value)
        lists.append(f'{value}')
    #print(lists)
    await dx.send(f"你的对象:{lists[0]}"\
                  f"\n年龄:{lists[1]}"\
                  f"\n身高:{lists[2]}cm"\
                  f"\n体重:{lists[3]}斤"\
                  f"\n胸围:{lists[4]}"\
                  f"\n性格:{lists[5]}")
